AcidAlchamy/autotlm-core/board-package/autotlm/esp32/boards.txt
# AutoTLM boards — thin platform over the Espressif esp32 core.
#
# The "AutoTLM One" board is an ESP32-class device; rather than fork the
# whole esp32 core we reference it (build.core=esp32:esp32), so builds use
# Espressif's toolchain and recipes while the IDE shows OUR board, OUR
# variant pin map and OUR defaults. The esp32 core (3.x) must be installed —
# the Arduino platform spec requires a referencing platform to share the
# referenced platform's architecture, which is why the FQBN is
# autotlm:esp32:one.

menu.UploadSpeed=Upload Speed
menu.PartitionScheme=Partition Scheme

# ---------------------------------------------------------------- AutoTLM One
one.name=AutoTLM One

one.bootloader.tool=esptool_py
one.bootloader.tool.default=esptool_py

one.upload.tool=esptool_py
one.upload.tool.default=esptool_py
one.upload.tool.network=esp_ota
one.upload.maximum_size=1310720
one.upload.maximum_data_size=327680
one.upload.flags=
one.upload.extra_flags=
one.upload.erase_cmd=

one.serial.disableDTR=true
one.serial.disableRTS=true

one.build.core=esp32:esp32
one.build.variant=one
one.build.tarch=xtensa
one.build.bootloader_addr=0x1000
one.build.target=esp32
one.build.mcu=esp32
one.build.board=AUTOTLM_ONE

one.build.f_cpu=240000000L
one.build.flash_size=4MB
one.build.flash_freq=40m
one.build.flash_mode=dio
one.build.boot=dio
one.build.partitions=default
one.build.defines=
one.build.loop_core=-DARDUINO_RUNNING_CORE=1
one.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
one.build.code_debug=0
one.build.copy_jtag_files=0
one.build.openocdscript=esp32-wrover-kit-3.3v.cfg
one.build.extra_libs=
one.build.zigbee_mode=
one.build.zigbee_libs=

one.menu.UploadSpeed.921600=921600
one.menu.UploadSpeed.921600.upload.speed=921600
one.menu.UploadSpeed.115200=115200
one.menu.UploadSpeed.115200.upload.speed=115200

one.menu.PartitionScheme.default=Default (1.3 MB app / 1.5 MB SPIFFS)
one.menu.PartitionScheme.default.build.partitions=default
one.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9 MB app)
one.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
one.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
one.menu.PartitionScheme.huge_app=Huge App (3 MB app, no OTA)
one.menu.PartitionScheme.huge_app.build.partitions=huge_app
one.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
